/*11. Подмассив наибольшей суммы
		Определите максимальную сумму в подмассиве
		
		// Setup
		var a = [
			[1, -10, 4, 5],
			[1, 5, 5, 3],
			[-1, 8, 4, 1],
			[1, -10, -4, 5],
			[1, 10, 4, 0],
		];

		Например:
		var a = [
			[1, 3, 6], 
			[3, 1, -1], 
			[3, 0]
		];
		
		Максимальная сумма тут первого подмассива: 1 + 3 + 6 = 10;
		Ответ: 10 */

var a = [
			[1, -10, 4, 5], //0
			[1, 5, 5, 3], // 14
			[-1, 8, 4, 1], // 12  26
			[1, -10, -4, 5], // -8 18
			[1, 10, 4, 0], // 15 33
		];

console.log(a.length);

var sum = 0;
for (var i = 0; i < a.length; i++){
	for (var j = 0; j < a[i].length; j++){
		sum=sum+a[i][j];
		
	}
	console.log(sum);
}




/*for (var i=0; i<a.length; i++){
	for (var j=0; j<a[i].length; j++){
		sum=sum+a[i][j];

	}
	
}

console.log(sum);*/